#+TITLE:Org-babel-mathomatic
#+AUTHOR: Luis Anaya
#+EMAIL:  papoanaya[at]hotmail[dot]com
#+LINK_UP:    ../languages.html
#+LINK_HOME:  http://orgmode.org/worg/
#+OPTIONS:    H:3 num:nil toc:2 \n:nil @:t ::t |:t ^:{} -:t f:t *:t TeX:t LaTeX:t skip:nil d:(HIDE) tags:not-in-toc
#+STARTUP:    align fold nodlcheck hidestars oddeven lognotestate hideblocks
#+SEQ_TODO:   TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+TAGS:       Write(w) Update(u) Fix(f) Check(c) noexport(n)
#+LANGUAGE:   en
#+STYLE:      <style type="text/css">#outline-container-introduction{ clear:both; }</style>

#+begin_html
  <div id="subtitle" style="float: center; text-align: center;">
  <p>
  Org-babel support for
  <a href="http://www.mathomatic.org/">Mathomatic</a>
  </p>
  </p>
  </div>
#+end_html
** Basic Use
An example of a Mathomatic  block in Org-babel is as follows:

#+begin_example
#+begin_src mathomatic :results output
x + 2
eliminate x
#+end_src

#+RESULTS: mathotest
: #1: x = 0
: #2: x + 2
: Eliminating variable x using solved equation #1...
: #2: 2
#+end_example 

Using =:results output= describes all the steps executed in the
code. using =:results value= will write the results in a table. For
example:

#+begin_example
#+begin_src mathomatic :results value
x = 0
x + 2
eliminate x
ans = x
#+end_src

#+RESULTS:
| #1:         | x        | = |     0 |        |          |       |
| #2:         | x        | + |     2 |        |          |       |
| Eliminating | variable | x | using | solved | equation | #1... |
| #2:         | 2        |   |       |        |          |       |
| #3:         | ans      | = |     x |        |          |       |
#+end_example


** Named Procedures
The Babel Mathomatic plugin supports the use of named procedures and calls
operations. The use of these are detailed in the /Org Manual/.  This
manual will describe how they are used within the context of a Mathomatic
script.

A variable can be passed to a Mathomatic script which can be used to call the
aforementioned program later on in your org document.  The following
example is a program that evaluates X+2. 

#+begin_example
#+name: mathotest(x=0)
#+begin_src mathomatic :results output
x + 2
eliminate x
#+end_src

#+RESULTS: mathotest
: #1: x = 0
: #2: x + 2
: Eliminating variable x using solved equation #1...
: #2: 2
#+end_example

Calling the named script with a different value will result in a
different execution. For example: 

#+begin_example
#+call: mathotest(x=30)

#+RESULTS: mathotest(x=30)
: #1: x = 30
: #2: x + 2
: Eliminating variable x using solved equation #1...
: #2: 32
#+end_example

Note that table processing is not supported. This is because Mathomatic
does not have support for matrixes. However there are 
plans to provide this in the future through the use of simulated
arrays.  A simulated array is a syntactic sugar in Mathomatic to enclose
indexes in square brackets (/[]/). 

